# модуль - це теж обєкт, який має свій простір імен.
# імпортінг модулів - це процес, який робить доступним код пайтону з іншого модуля.

import sys
import math

print(sys.stdlib_module_names)
# константа, яка виводить
# перелік всіх стандартних модулів, які є у пайтоні
# у вигляді немутованої множини - нічого не можемо додати чи забрати

print(sys.builtin_module_names)
# константа, яка виводить
# перелік всіх вбудованих модулв як кортеж

# модулі теж мають різні атрибути
print(math.__name__)
print(math.__doc__)

# всі атрибути модуля є у відповідному словнику
print(math.__dict__)
# який можна змінити

# всі імпортовані модулі є у відповідному словнику
for item in sys.modules:
    print(item, ' - ', sys.modules[item])

# при імпортінгу весь модуль виконується !!!, навіть якщо імпортуємо одну функцію
